title: Suspicious Script Execution via MMC Loading VBScript DLL
id: a9c73e8b-3b2d-4c45-8ef2-5f9a9c9998ad
status: experimental
description: |
    Detects when the Microsoft Management Console (MMC) loads the vbscript.dll library, which might indicate an attempt
    to execute malicious scripts within a trusted system process for bypassing application whitelisting or defense evasion.
references:
    - https://tria.ge/241015-l98snsyeje/behavioral2
author: Swachchhanda Shrawan Poudel
tags:
    - attack.execution
    - attack.defense-evasion
    - attack.t1220
    - attack.t1059.005
date: 2024-11-21
logsource:
    category: image_load
    product: windows
detection:
    selection:
        Image|endswith: '\mmc.exe'
        ImageLoaded|endswith: '\vbscript.dll'
    condition: selection
falsepositives:
    - Legitimate MMC operations or extensions loading vbscript.dll.
    - Administrative or system scripts that utilize vbscript.dll.
level: high

