title: Suspicious Child Processes Spawned by ConHost
id: dfa03a09-8b92-4d83-8e74-f72839b1c407
status: experimental
description: Detects suspicious child processes related to Windows Shell utilities spawned by `conhost.exe`, which could indicate malicious activity using trusted system components.
references:
    - https://tria.ge/241015-l98snsyeje/behavioral2
author: Swachchhanda Shrawan Poudel
date: 2024-11-20
tags:
    - attack.t1202
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    selection_parent:
        ParentImage|endswith: '\conhost.exe'
    selection_child:
        - Image|endswith:
            - '\cmd.exe'             # Windows Command Prompt
            - '\powershell.exe'      # Windows PowerShell
            - '\pwsh.exe'            # PowerShell Core
            - '\regsvr32.exe'        # Windows Registry Server (commonly used for exploits)
            - '\cscript.exe'         # Windows Script Host (used for scripting exploits)
            - '\mshta.exe'           # MSHTA (HTML Application Host, often abused)
            - '\wscript.exe'         # Windows Script Host (for executing scripts)
        - OriginalFileName:
            - 'cmd.exe'
            - 'powershell.exe'
            - 'pwsh.exe'
            - 'regsvr32.exe'
            - 'cscript.exe'
            - 'mshta.exe'
            - 'wscript.exe'
    condition: all of selection_*
falsepositives:
    - Legitimate administrative tasks using `conhost.exe` to spawn child processes such as `cmd.exe`, `powershell.exe`, or `regsvr32.exe`.
level: high
