title: Unusual Executable File Extension Detection
id: d839b52b-9e84-4825-bd4f-c95c57f6b4c8
status: experimental
description: |
    Detects processes where the image file does not have the typical `.exe` extension, indicating possible attempts to evade detection.
references:
    - https://tria.ge/241102-1hhvhawenh/behavioral1
author: Swachchhanda Shrawan Poudel
date: 2024-11-21
tags:
    - attack.defense-evasion
logsource:
    category: process_creation
    product: windows
detection:
    filter_no_exe_extension:
        Image|endswith: '.exe'
    condition: not filter_no_exe_extension
falsepositives:
    - Unknown
level: high
